tocrux/SONIX_BadaPen_BLE_nrf52811/SaeA_Service.c
#include "sdk_common.h"
#if NRF_MODULE_ENABLED(BLE_NUS)
#include "ble.h"
#include "SaeA_Service.h"
#include "ble_srv_common.h"

#define NRF_LOG_MODULE_NAME ble_saea
#if BLE_NUS_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL       BLE_saea_CONFIG_LOG_LEVEL
#define NRF_LOG_INFO_COLOR  BLE_saea_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR BLE_saea_CONFIG_DEBUG_COLOR
#else // BLE_saea_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL       0
#endif // BLE_saea_CONFIG_LOG_ENABLED
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();


#define BLE_UUID_BADAPEN_SERVICE        0xFF00

// #define BLE_UUID_saea_TX_CHARACTERISTIC  0xFF01       // 7 byte oid code send tx uuid
// #define BLE_UUID_saea_RX_CHARACTERISTIC  0xFF02       

#define BLE_UUID_BADAPEN_01_TX_CHARACTERISTIC  0xFF01       // 7 byte oid code send tx uuid
#define BLE_UUID_BADAPEN_02_TX_CHARACTERISTIC  0xFF02
#define BLE_UUID_BADAPEN_03_TX_CHARACTERISTIC  0xFF03
#define BLE_UUID_BADAPEN_05_RX_CHARACTERISTIC  0xFF05
#define BLE_UUID_BADAPEN_07_TX_CHARACTERISTIC  0xFF07
#define BLE_UUID_BADAPEN_08_TX_CHARACTERISTIC  0xFF08
#define BLE_UUID_BADAPEN_09_TX_CHARACTERISTIC  0xFF09
#define BLE_UUID_BADAPEN_11_RX_CHARACTERISTIC  0xFF11

#define BLE_SAEA_MAX_RX_CHAR_LEN        BLE_SAEA_MAX_DATA_LEN /**< Maximum length of the RX Characteristic (in bytes). */
#define BLE_SAEA_MAX_TX_CHAR_LEN        BLE_SAEA_MAX_DATA_LEN /**< Maximum length of the TX Characteristic (in bytes). */
#define BLE_BADAPEN_MAX_TX_CHAR_LEN        7

// #define NUS_BASE_UUID                  {{0x9E, 0xCA, 0xDC, 0x24, 0x0E, 0xE5, 0xA9, 0xE0, 0x93, 0xF3, 0xA3, 0xB5, 0x00, 0x00, 0x40, 0x6E}} /**< Used vendor specific UUID. */

//                              FB    34    9B    5F    80    00    00    80    00    10    00    00    00    FF    00    00
#define BADAPEN_BASE_UUID       {{0xFB, 0x34, 0x9B, 0x5F, 0x80, 0x00, 0x00, 0x80, 0x00, 0x10, 0x00, 0x00, 0x00, 0xFF, 0x00, 0x10}} /**< Used vendor specific UUID. */



/**@brief Function for handling the @ref BLE_GAP_EVT_CONNECTED event from the SoftDevice.
 *
 * @param[in] p_saea     Nordic UART Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_connect(ble_saea_t * p_saea, ble_evt_t const * p_ble_evt)
{
    ret_code_t                 err_code;
    ble_saea_evt_t              evt;
    ble_gatts_value_t          gatts_val;
    uint8_t                    cccd_value[2];
    ble_nus_client_context_t * p_client = NULL;

    err_code = blcm_link_ctx_get(p_saea->p_link_ctx_storage,
                                 p_ble_evt->evt.gap_evt.conn_handle,
                                 (void *) &p_client);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Link context for 0x%02X connection handle could not be fetched.",
                      p_ble_evt->evt.gap_evt.conn_handle);
    }

    /* Check the hosts CCCD value to inform of readiness to send data using the RX characteristic */
    memset(&gatts_val, 0, sizeof(ble_gatts_value_t));
    gatts_val.p_value = cccd_value;
    gatts_val.len     = sizeof(cccd_value);
    gatts_val.offset  = 0;

    err_code = sd_ble_gatts_value_get(p_ble_evt->evt.gap_evt.conn_handle,
                                      p_saea->tx_F01_handles.cccd_handle,
                                      &gatts_val);

    if ((err_code == NRF_SUCCESS)     &&
        (p_saea->data_handler != NULL) &&
        ble_srv_is_notification_enabled(gatts_val.p_value))
    {
        if (p_client != NULL)
        {
            p_client->is_notification_enabled = true;
        }

        memset(&evt, 0, sizeof(ble_saea_evt_t));
        evt.type        = BLE_SAEA_EVT_COMM_STARTED;
        evt.p_saea       = p_saea;
        evt.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
        evt.p_link_ctx  = p_client;

        p_saea->data_handler(&evt);
    }
}


/**@brief Function for handling the @ref BLE_GATTS_EVT_WRITE event from the SoftDevice.
 *
 * @param[in] p_saea     Nordic UART Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_write(ble_saea_t * p_saea, ble_evt_t const * p_ble_evt)
{
    ret_code_t                    err_code;
    ble_saea_evt_t                 evt;
    ble_nus_client_context_t    * p_client;
    ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;

    err_code = blcm_link_ctx_get(p_saea->p_link_ctx_storage,
                                 p_ble_evt->evt.gatts_evt.conn_handle,
                                 (void *) &p_client);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Link context for 0x%02X connection handle could not be fetched.",
                      p_ble_evt->evt.gatts_evt.conn_handle);
    }

    memset(&evt, 0, sizeof(ble_saea_evt_t));
    evt.p_saea       = p_saea;
    evt.conn_handle = p_ble_evt->evt.gatts_evt.conn_handle;
    evt.p_link_ctx  = p_client;

    if (((p_evt_write->handle == p_saea->tx_F01_handles.cccd_handle) ||
         (p_evt_write->handle == p_saea->tx_F02_handles.cccd_handle) ||
         (p_evt_write->handle == p_saea->tx_F03_handles.cccd_handle) ||
         (p_evt_write->handle == p_saea->tx_F07_handles.cccd_handle) ||
         (p_evt_write->handle == p_saea->tx_F08_handles.cccd_handle) ||
         (p_evt_write->handle == p_saea->tx_F09_handles.cccd_handle)) &&
         (p_evt_write->len == 2))
    {
        if (p_client != NULL)
        {
            if (ble_srv_is_notification_enabled(p_evt_write->data))
            {
                p_client->is_notification_enabled = true;
                evt.type                          = BLE_SAEA_EVT_COMM_STARTED;
            }
            else
            {
                p_client->is_notification_enabled = false;
                evt.type                          = BLE_SAEA_EVT_COMM_STOPPED;
            }

            if (p_saea->data_handler != NULL)
            {
                p_saea->data_handler(&evt);
            }

        }
    }
    else if (((p_evt_write->handle == p_saea->rx_F05_handles.value_handle) ||
              (p_evt_write->handle == p_saea->rx_F05_handles.value_handle)) &&
             (p_saea->data_handler != NULL))
    {
        evt.type                  = BLE_SAEA_EVT_RX_DATA;
        evt.params.rx_data.p_data = p_evt_write->data;
        evt.params.rx_data.length = p_evt_write->len;

        p_saea->data_handler(&evt);
    }
    else
    {
        // Do Nothing. This event is not relevant for this service.
    }
}


/**@brief Function for handling the @ref BLE_GATTS_EVT_HVN_TX_COMPLETE event from the SoftDevice.
 *
 * @param[in] p_saea     Nordic UART Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_hvx_tx_complete(ble_saea_t * p_saea, ble_evt_t const * p_ble_evt)
{
    ret_code_t                 err_code;
    ble_saea_evt_t              evt;
    ble_nus_client_context_t * p_client;

    err_code = blcm_link_ctx_get(p_saea->p_link_ctx_storage,
                                 p_ble_evt->evt.gatts_evt.conn_handle,
                                 (void *) &p_client);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Link context for 0x%02X connection handle could not be fetched.",
                      p_ble_evt->evt.gatts_evt.conn_handle);
        return;
    }

    if (p_client->is_notification_enabled)
    {
        memset(&evt, 0, sizeof(ble_saea_evt_t));
        evt.type        = BLE_SAEA_EVT_TX_RDY;
        evt.p_saea       = p_saea;
        evt.conn_handle = p_ble_evt->evt.gatts_evt.conn_handle;
        evt.p_link_ctx  = p_client;

        p_saea->data_handler(&evt);
    }
}


void ble_saea_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    if ((p_context == NULL) || (p_ble_evt == NULL))
    {
        return;
    }

    ble_saea_t * p_saea = (ble_saea_t *)p_context;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            on_connect(p_saea, p_ble_evt);
            break;

        case BLE_GATTS_EVT_WRITE:
            on_write(p_saea, p_ble_evt);
            break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE:
            on_hvx_tx_complete(p_saea, p_ble_evt);
            break;

        default:
            // No implementation needed.
            break;
    }
}


uint32_t ble_badapen_init(ble_saea_t * p_saea, ble_saea_init_t const * p_saea_init)
{
    ret_code_t            err_code;
    ble_uuid_t            ble_uuid;
    ble_uuid128_t         saea_base_uuid = BADAPEN_BASE_UUID;
    ble_add_char_params_t add_char_params;

    VERIFY_PARAM_NOT_NULL(p_saea);
    VERIFY_PARAM_NOT_NULL(p_saea_init);

    // Initialize the service structure.
    p_saea->data_handler = p_saea_init->data_handler;

    /**@snippet [Adding proprietary Service to the SoftDevice] */
    // Add a custom base UUID.
    err_code = sd_ble_uuid_vs_add(&saea_base_uuid, &p_saea->uuid_type);
    VERIFY_SUCCESS(err_code);

    ble_uuid.type = p_saea->uuid_type;
    ble_uuid.uuid = BLE_UUID_BADAPEN_SERVICE;   // 0xFF00 : Service UUID

    // Add the service.
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                        &ble_uuid,
                                        &p_saea->service_handle);
    /**@snippet [Adding proprietary Service to the SoftDevice] */
    VERIFY_SUCCESS(err_code);

    // Add the TX Characteristic.
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = BLE_UUID_BADAPEN_01_TX_CHARACTERISTIC;
    add_char_params.uuid_type         = p_saea->uuid_type;
    add_char_params.max_len           = BLE_BADAPEN_MAX_TX_CHAR_LEN;
    add_char_params.init_len          = sizeof(uint8_t);
    add_char_params.is_var_len        = true;
    add_char_params.char_props.notify = 1;

    add_char_params.read_access       = SEC_OPEN;
    add_char_params.write_access      = SEC_OPEN;
    add_char_params.cccd_write_access = SEC_OPEN;

    

    err_code = characteristic_add(p_saea->service_handle, &add_char_params, &p_saea->tx_F01_handles);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }


    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = BLE_UUID_BADAPEN_02_TX_CHARACTERISTIC;
    add_char_params.uuid_type         = p_saea->uuid_type;
    add_char_params.max_len           = sizeof(uint8_t);
    add_char_params.init_len          = sizeof(uint8_t);
    add_char_params.is_var_len        = true;
    add_char_params.char_props.notify = 1;

    add_char_params.read_access       = SEC_OPEN;
    add_char_params.write_access      = SEC_OPEN;
    add_char_params.cccd_write_access = SEC_OPEN;

    err_code = characteristic_add(p_saea->service_handle, &add_char_params, &p_saea->tx_F02_handles);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = BLE_UUID_BADAPEN_03_TX_CHARACTERISTIC;
    add_char_params.uuid_type         = p_saea->uuid_type;
    add_char_params.max_len           = sizeof(uint8_t);
    add_char_params.init_len          = sizeof(uint8_t);
    add_char_params.is_var_len        = true;
    add_char_params.char_props.notify = 1;

    add_char_params.read_access       = SEC_OPEN;
    add_char_params.write_access      = SEC_OPEN;
    add_char_params.cccd_write_access = SEC_OPEN;

    err_code = characteristic_add(p_saea->service_handle, &add_char_params, &p_saea->tx_F03_handles);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Add the RX Characteristic.
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid                     = BLE_UUID_BADAPEN_05_RX_CHARACTERISTIC;
    add_char_params.uuid_type                = p_saea->uuid_type;
    add_char_params.max_len                  = sizeof(uint8_t);
    add_char_params.init_len                 = sizeof(uint8_t);
    add_char_params.is_var_len               = true;
    add_char_params.char_props.write         = 1;
    add_char_params.char_props.write_wo_resp = 1;

    add_char_params.read_access  = SEC_OPEN;
    add_char_params.write_access = SEC_OPEN;

    err_code = characteristic_add(p_saea->service_handle, &add_char_params, &p_saea->rx_F05_handles);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = BLE_UUID_BADAPEN_07_TX_CHARACTERISTIC;
    add_char_params.uuid_type         = p_saea->uuid_type;
    add_char_params.max_len           = sizeof(uint8_t);
    add_char_params.init_len          = sizeof(uint8_t);
    add_char_params.is_var_len        = true;
    add_char_params.char_props.notify = 1;

    add_char_params.read_access       = SEC_OPEN;
    add_char_params.write_access      = SEC_OPEN;
    add_char_params.cccd_write_access = SEC_OPEN;

    err_code = characteristic_add(p_saea->service_handle, &add_char_params, &p_saea->tx_F07_handles);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = BLE_UUID_BADAPEN_08_TX_CHARACTERISTIC;
    add_char_params.uuid_type         = p_saea->uuid_type;
    add_char_params.max_len           = sizeof(uint8_t);
    add_char_params.init_len          = sizeof(uint8_t);
    add_char_params.is_var_len        = true;
    add_char_params.char_props.notify = 1;

    add_char_params.read_access       = SEC_OPEN;
    add_char_params.write_access      = SEC_OPEN;
    add_char_params.cccd_write_access = SEC_OPEN;

    err_code = characteristic_add(p_saea->service_handle, &add_char_params, &p_saea->tx_F08_handles);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = BLE_UUID_BADAPEN_09_TX_CHARACTERISTIC;
    add_char_params.uuid_type         = p_saea->uuid_type;
    add_char_params.max_len           = sizeof(uint8_t);
    add_char_params.init_len          = sizeof(uint8_t);
    add_char_params.is_var_len        = true;
    add_char_params.char_props.notify = 0;

    add_char_params.read_access       = SEC_OPEN;
    add_char_params.write_access      = SEC_OPEN;
    add_char_params.cccd_write_access = SEC_OPEN;

    err_code = characteristic_add(p_saea->service_handle, &add_char_params, &p_saea->tx_F09_handles);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Add the TX Characteristic.
    /**@snippet [Adding proprietary characteristic to the SoftDevice] */
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = BLE_UUID_BADAPEN_11_RX_CHARACTERISTIC;
    add_char_params.uuid_type         = p_saea->uuid_type;
    add_char_params.max_len           = BLE_SAEA_MAX_RX_CHAR_LEN;
    add_char_params.init_len          = sizeof(uint8_t);
    add_char_params.is_var_len        = true;
    add_char_params.char_props.write         = 1;
    add_char_params.char_props.write_wo_resp = 1;

    add_char_params.read_access  = SEC_OPEN;
    add_char_params.write_access = SEC_OPEN;

    return characteristic_add(p_saea->service_handle, &add_char_params, &p_saea->rx_F011_handles);
    /**@snippet [Adding proprietary characteristic to the SoftDevice] */
}

/*
uint32_t ble_saea_data_send(ble_saea_t * p_saea,
                           uint8_t   * p_data,
                           uint16_t  * p_length,
                           uint16_t    conn_handle)
{
    ret_code_t                 err_code;
    ble_gatts_hvx_params_t     hvx_params;
    ble_nus_client_context_t * p_client;

    VERIFY_PARAM_NOT_NULL(p_saea);

    err_code = blcm_link_ctx_get(p_saea->p_link_ctx_storage, conn_handle, (void *) &p_client);
    VERIFY_SUCCESS(err_code);

    if ((conn_handle == BLE_CONN_HANDLE_INVALID) || (p_client == NULL))
    {
        return NRF_ERROR_NOT_FOUND;
    }

    if (!p_client->is_notification_enabled)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (*p_length > BLE_saea_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_saea->tx_handles.value_handle;
    hvx_params.p_data = p_data;
    hvx_params.p_len  = p_length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(conn_handle, &hvx_params);
}
*/


uint32_t ble_f01_data_send(ble_saea_t * p_saea,
                           uint8_t   * p_data,
                           uint16_t  * p_length,
                           uint16_t    conn_handle)
{
    ret_code_t                 err_code;
    ble_gatts_hvx_params_t     hvx_params;
    ble_nus_client_context_t * p_client;

    VERIFY_PARAM_NOT_NULL(p_saea);

    err_code = blcm_link_ctx_get(p_saea->p_link_ctx_storage, conn_handle, (void *) &p_client);
    VERIFY_SUCCESS(err_code);

    if ((conn_handle == BLE_CONN_HANDLE_INVALID) || (p_client == NULL))
    {
        return NRF_ERROR_NOT_FOUND;
    }

    if (!p_client->is_notification_enabled)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (*p_length > BLE_SAEA_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_saea->tx_F01_handles.value_handle;
    hvx_params.p_data = p_data;
    hvx_params.p_len  = p_length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(conn_handle, &hvx_params);
}



#endif // NRF_MODULE_ENABLED(BLE_saea)
